In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
!cat ../pydata-book/ch06/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('../pydata-book/ch06/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('../pydata-book/ch06/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat ../pydata-book/ch06/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('../pydata-book/ch06/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('../pydata-book/ch06/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('../pydata-book/ch06/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
parsed = pd.read_csv('../pydata-book/ch06/csv_mindex.csv', index_col=['key1', 'key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
list(open('../pydata-book/ch06/ex3.csv'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [13]:
result = pd.read_table('../pydata-book/ch06/ex3.csv', sep='\s+')

In [14]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
!cat ../pydata-book/ch06/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv('../pydata-book/ch06/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!cat ../pydata-book/ch06/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
result = pd.read_csv('../pydata-book/ch06/ex5.csv')

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [21]:
result =  pd.read_csv('../pydata-book/ch06/ex5.csv', na_values=['NULL'])

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
result = pd.read_csv('../pydata-book/ch06/ex6.csv')

In [24]:
result = pd.read_csv('../pydata-book/ch06/ex6.csv', nrows=5)

In [25]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv('../pydata-book/ch06/ex6.csv', chunksize=1000)

In [27]:
chunker

In [28]:
tot = Series()

In [29]:
tot

Series([], dtype: float64)

In [30]:
tot = Series([])

In [31]:
tot

Series([], dtype: float64)

In [32]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [33]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [34]:
data = pd.read_csv('../pydata-book/ch06/ex5.csv')

In [35]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
!cat ../pydata-book/ch06/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [37]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [38]:
data.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [39]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [60]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [61]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [62]:
dates = pd.date_range('1/1/2000', periods=7)

In [63]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [64]:
ts = Series(np.arange(7), index=dates)

In [65]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [66]:
ts.to_csv('ch06/tseries.csv')

In [47]:
!cat ch06/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [48]:
!cat ../pydata-book/ch06/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [49]:
import csv
f = open('../pydata-book/ch06/ex7.csv')
reader = csv.reader(f)
reader

In [50]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [69]:
lines = list(csv.reader(open('../pydata-book/ch06/ex7.csv')))
lines

list

In [70]:
type(lines)

list

In [51]:
obj = """
{"names": "Wes",
 "places_lives": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"names": "Scott", "age": 25, "pet": "Zuko"},
             {"names": "Katie", "age": 30, "pet": "Ciisco"}]
}
"""

In [52]:
obj

'\n{"names": "Wes",\n "places_lives": ["United States", "Spain", "Germany"],\n "pet": null,\n "siblings": [{"names": "Scott", "age": 25, "pet": "Zuko"},\n             {"names": "Katie", "age": 30, "pet": "Ciisco"}]\n}\n'

In [53]:
import json

In [54]:
result = json.loads(obj)

In [55]:
result

{'names': 'Wes',
 'pet': None,
 'places_lives': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'names': 'Scott', 'pet': 'Zuko'},
  {'age': 30, 'names': 'Katie', 'pet': 'Ciisco'}]}

In [56]:
asjson = json.dumps(result)

In [57]:
asjson

'{"names": "Wes", "places_lives": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"names": "Scott", "age": 25, "pet": "Zuko"}, {"names": "Katie", "age": 30, "pet": "Ciisco"}]}'

In [58]:
siblings = DataFrame(result['siblings'], columns=['names', 'age'])

In [59]:
siblings

   names  age
0  Scott   25
1  Katie   30

In [71]:
from lxml.html import parse
from urllib import urlopen

ImportError: cannot import name 'urlopen'